package temp;

import java.io.FileNotFoundException;
import java.io.FileOutputStream;
import java.io.FileWriter;
import java.io.PrintWriter;

public class ToString {
private static String[] strings = new String[10];
private static void ToString(String args){
	
}
public static void main(String[] args){
	String a ="http://bbs.tianya.cn/post-stocks-1437237-1.shtml       标题：[我来告诉大家，聚金汇银是不是骗子公司]          正文：[　　的确，聚金汇银是个骗子公司，听我详细道来。]          [楼主：临时注册的用户 时间：2015-06-30 23:27:00 点击：1299 回复：58  [　　他们的欺骗手法如下：业务员整天缠着客户开户入金，把客户加入他们的QQ群，QQ群里面整天发着现货原油盈利的截图。也有个别活跃成员现身说法，说如何盈利。等客户开户入金之后，就说群升级，把客户踢出QQ群。然后让客户加上他们分析师的QQ，然后就由分析师带客户做单了。分析师喜欢给客户下全仓操作、频繁操作指令，直到客户亏损完毕。 楼主：临时注册的用户 时间：2015-06-30 23:36:57   　　顶楼主！ 　　 作者：橙子的橙子的橙子 时间：2015-06-30 23:42:32   　　好，既然有人顶，我就继续，有截图为证 楼主：临时注册的用户 时间：2015-06-30 23:47:10   　　 　　这是那个业务员的QQ 楼主：临时注册的用户 时间：2015-06-30 23:49:21   　　我开户入金之后就被踢出了这个QQ群，就是被最下面那个人踢出的，他们以北商所的名义，做现货石油。 　　 楼主：临时注册的用户 时间：2015-06-30 23:57:04   　　然后就有分析师待我操作了，这是分析师的QQ。 　　 楼主：临时注册的用户 时间：2015-06-30 23:59:13   　　分析师一上来就给我下达满仓的指令，我虽有犹豫，但考虑到他是专业人员，将信将疑，做了。 　　 楼主：临时注册的用户 时间：2015-07-01 00:03:00   　　当时正处于图中高点，分析师让我全仓做多。 　　 楼主：临时注册的用户 时间：2015-07-01 00:07:14   　　下单之后我感觉形势不对，向分析师确认，是否下错单，分析师说放心没错。 　　 楼主：临时注册的用户 时间：2015-07-01 00:11:31   　　下跌到底部时，分析师让我平掉多单。期间我向他提出了意见。 　　 楼主：临时注册的用户 时间：2015-07-01 00:14:28   　　当下跌到底部时，分析师让我全仓做空。直到没钱补仓。我觉得很不对劲，于是平仓出局。幸好及时平仓出局，亏损加手续费工7W。 　　 　　 楼主：临时注册的用户 时间：2015-07-01 00:19:23   　　然后我跟分析师理论了一整子，并说要公布我们的聊天记录，然后第二天账户余额就被扣留了，无法出金，无法转入银行卡。备注：建行本来几乎可以24小时出入金。 　　 楼主：临时注册的用户 时间：2015-07-01 00:25:56   　　然后我欺骗业务员说需要加金换老师继续操作，才恢复出入金功能。于是赶快将余额转入银行卡。 楼主：临时注册的用户 时间：2015-07-01 00:27:33   　　然后我再仔细研究了他们的交易软件，发现了其中一个很大的问题，简直就是欺骗客户，故意让客户不能按照客户的意愿下单。其中指定价格必须在当前价格正负30点以外，止盈止损价格至少需要再往后30点，不然系统无法下单。意思是至少需要波动60点，客户才可能盈利。而原油是很难被预料波动60点以上的。 　　 楼主：临时注册的用户 时间：2015-07-01 00:36:28   　　其实，我也不算贪心，只因前几天股市不好，被业务员纠缠，自己也想尝试一种新的投资方式而已。本想稳健获利一点，没想到竟是如此结局。在此发帖仅仅是提醒后来人不要上当受骗。 楼主：临时注册的用户 时间：2015-07-01 00:39:43   　　我已决定每天顶贴一次，提醒后来人不要上当受骗。 楼主：临时注册的用户 时间：2015-07-01 00:42:43   　　顶。。。。 　　 作者：萌芽邪恶1 时间：2015-07-01 00:50:12   　　@萌芽邪恶1 2015-07-01 00:50:12 　　顶。。。。 　　----------------------------- 　　谢谢，好人一生平安 楼主：临时注册的用户 时间：2015-07-01 00:55:44   　　顶 　　 作者：小庄严 时间：2015-07-01 01:03:50   　　@小庄严 2015-07-01 01:03:50 　　顶 　　----------------------------- 　　谢谢，好人一生平安 楼主：临时注册的用户 时间：2015-07-01 01:06:46   　　聚金汇银公司居然还在网上澄清，想妖言惑众，我就是信了这些澄清才上当的。 　　如下澄清都是托，大家不要相信： 　　http://www.douban.com/group/topic/55102671/ 　　http://tieba.baidu.com/p/3378871246 　　http://bbs.tianya.cn/post-free-4949608-1.shtml 楼主：临时注册的用户 时间：2015-07-01 01:09:36   　　聚金汇银公司在天涯上有个托儿，大家可以围观： 　　http://www.tianya.cn/n/xionghaigen1983 　　就是这个托儿，不知害了多少人。 楼主：临时注册的用户 时间：2015-07-01 01:17:21   　　好，楼主睡前最后一顶帖 楼主：临时注册的用户 时间：2015-07-01 01:29:01   　　早上起来，觉得要把骗子的信息用文字版发布出来，方便以后的人搜索到。 　　骗子的QQ号 942715969，202726710 　　骗子的电话 0551 66196675,18356523202,0551 66196182,0051 66010698,0051 66036009 楼主：临时注册的用户 时间：2015-07-01 08:14:01   　　多谢正义的天涯社区 楼主：临时注册的用户 时间：2015-07-01 08:14:55   　　看不过去继续顶。。。 　　 作者：萌芽邪恶1 时间：2015-07-01 11:48:45   　　@萌芽邪恶1 2015-07-01 11:48:45 　　看不过去继续顶。。。 　　----------------------------- 　　谢谢，看的出来，您是一个有正义感的人，谢谢。 楼主：临时注册的用户 时间：2015-07-01 19:32:42   　　附上我不做退出之后，分析师对我进行谩骂的截图。这个分析师就是我说要换个分析师继续操作之后，他们给换的一个分析师，看聊天情况，他根本不可能是分析师。 这个所谓的分析师态度嚣张，一副诈骗得逞你能赖我何的样子。不知这样的公司为何还有恃无恐地继续存在，继续欺骗。希望后来人看见此贴之后不再上当。 　　 　　 　　 　　 　　 　　 　　 　　 　　 楼主：临时注册的用户 时间：2015-07-01 21:15:52   　　大凡被北京大宗骗过的人都在不在，我们都联手，去公司找他们，不能这样算了。加QQ2998403864 作者：揭露黑幕2015 时间：2015-07-05 11:39:35   　　@揭露黑幕2015 2015-07-05 11:39:35 　　大凡被北京大宗骗过的人都在不在，我们都联手，去公司找他们，不能这样算了。加QQ2998403864 　　----------------------------- 　　您好。您可以搜索QQ群，关键字为“北商所”、“维权”。里面有很多像我们一样的被骗客户。 楼主：临时注册的用户 时间：2015-07-05 23:29:00   　　有空再来顶一顶，现在想起来好后怕，幸好当时波动得还算慢，还来得及平仓，如果瞬间波动60点以上，我就被爆仓了，变得分文不剩。还好还好。那老师的指令，简直是爆仓的节奏，毛骨悚然。 楼主：临时注册的用户 时间：2015-07-10 21:56:42   　　@临时注册的用户 2015-07-10 21:56:42 　　有空再来顶一顶，现在想起来好后怕，幸好当时波动得还算慢，还来得及平仓，如果瞬间波动60点以上，我就被爆仓了，变得分文不剩。还好还好。那老师的指令，简直是爆仓的节奏，毛骨悚然。 　　----------------------------- 　　都是天涯被坑人啊！被坑好几万，聚金汇银大骗子公司！ 作者：吃亏涨智 时间：2015-07-18 23:01:32   　　@临时注册的用户 2015-07-10 21:56:42 　　有空再来顶一顶，现在想起来好后怕，幸好当时波动得还算慢，还来得及平仓，如果瞬间波动60点以上，我就被爆仓了，变得分文不剩。还好还好。那老师的指令，简直是爆仓的节奏，毛骨悚然。 　　----------------------------- 　　@吃亏涨智 2015-07-18 23:01:32 　　都是天涯被坑人啊！被坑好几万，聚金汇银大骗子公司！ 　　----------------------------- 　　这家骗子公司，防不胜防，良心被狗吃了。 楼主：临时注册的用户 时间：2015-07-19 09:36:02   　　@临时注册的用户 加你了 加我一下 作者：中国魔法师 时间：2015-07-20 20:15:19   　　又到了顶一顶的时候了，一个月纪念 楼主：临时注册的用户 时间：2015-07-29 20:04:16   　　为何要删我的贴？文中句句属实，不存在任何违法内容。 楼主：临时注册的用户 时间：2015-08-06 23:52:02   　　周末到了，顶一顶。北商所诈骗维权QQ群：383277251。 楼主：临时注册的用户 时间：2015-08-08 11:06:45   　　又该顶贴了……很多难友发帖都被各个网站删除了，没想到我的帖子能够支撑这么久。 　　最近老是有现货公司给我打电话，加我QQ。前段时间有个QQ号365946650加我入群256711568，我进去之后观察他们是否像聚金汇银公司一样是骗子，还没来得及得出结论，然后整天问我有无关注行情，看我没多大意思，就把我踢了。看来他们很着急……呵呵 楼主：临时注册的用户 时间：2015-08-17 21:18:54   　　最新消息，聚金汇银网站 http://www.168180.cc/ 自8月6日起就没更新了，当初骗我的QQ已经停用了，当初骗我的QQ群已经解散了。 　　看来骗子又换了身份继续行骗了……不知又有多少人要被骗了。很多人被骗的倾家荡产。 楼主：临时注册的用户 时间：2015-08-22 21:51:31   　　看北京聚金汇银的网站，貌似正规啊，但其实是在掩盖他们干的那些诈骗勾当。下面的图片，大家看了，笑笑就好。 　　 楼主：临时注册的用户 时间：2015-08-22 21:59:09   　　下面是一个月以前的截图，是北商所诈骗维权群383277251里面被其31号会员聚金汇银诈骗的截图，然而这仅仅只冰山一角。 　　 楼主：临时注册的用户 时间：2015-08-22 22:07:39   　　一个其它平台受害难友的最新消息，他已经得到了部分赔偿，在与骗子电话沟通的过程中得知（骗子公司业务员亲口原话）：“人不为己天诛地灭，说白了，做这行就是坑人的，公司以每个5元的价格购买潜在客户信息，业务员要想尽一切办法引诱潜在客户开户入金，公司按照客户入金量给业务员提成30%，有的公司还更多呢，公司总共160号人，上月共发工资370万”。 　　所以： 　　1. 现货市场，比如现货原油和现货白银，大多数都是坑人的； 　　2. 业务员可以拿到客户入金量的30%提成甚至更多，如此必然以客户爆仓为代价。 　　3. 只要客户入金就能拿到30%的提成，再次加金可再次提成，其余的都跟业务员没关系，什么长期合作，什么只提成手续费，都是骗人的； 　　4. 业务员有的是手段让潜在客户开户入金，针对不同客户手段不同； 　　5. 潜在客户的信息，可能是被股票软件、券商内部人员出卖了的； 　　6. 不要小看一个小小的业务员，人家哪怕每个月只有一个10W级别客户，每月都能保证有3万以上的收入，完全金领级别啊，如果有幸拉一个百万级别的客户，一线城市一套房子的首付都有了……所以人家才像打了鸡血一样，用尽一切手段，拼命拉潜在客户开户入金啊。 楼主：临时注册的用户 时间：2015-09-03 15:47:21   　　好久没来了，北商所诈骗维权群383277251里面总是不断地有新人加入，每一个都被骗的很惨，很多倾家荡产，其中被其31号会员单位聚金汇银骗的人最多，好痛心。 楼主：临时注册的用户 时间：2015-09-12 13:15:52   　　最新一个传言，有两个版本。 　　版本一，齐鲁商品交易中心网站说法如下： 　　有部分违法群体假扮客户诱导会员公司，完成交易行为后，雇佣恶意维权讨债公司上门骚扰、打砸，通过此方式索要超额补偿。2015年9月11日，恶意讨债公司群体到齐鲁商品办公场所滋事，扰乱正常办公秩序，后滋事人员被公安全部带走，将受到法律的严厉制裁。 　　http://xianhuo.cnfol.com/announcement/20150911/21433543.shtml 　　版本二，民间有如下说法： 　　被齐鲁商品交易中心诈骗的维权者前往齐鲁维权，齐鲁老总雇佣黑社会成员对维权群众进行殴打，并说他的后台就是市长，有种就告。但最后双方都被警察带走了。 楼主：临时注册的用户 时间：2015-09-12 13:32:41   　　目前负面传言比较多的现货交易所或者现货交易中心有：北京大宗商品交易所，齐鲁商品交易中心，华夏商品交易市场，新华大宗商品交易中心，深圳石油化工交易所。当然这些交易中心或者交易所的说法是：1. 同行恶意攻击；2. 群众恶意维权。 楼主：临时注册的用户 时间：2015-09-12 13:40:07   　　@临时注册的用户 2015-09-12 13:40:07 　　目前负面传言比较多的现货交易所或者现货交易中心有：北京大宗商品交易所，齐鲁商品交易中心，华夏商品交易市场，新华大宗商品交易中心，深圳石油化工交易所。当然这些交易中心或者交易所的说法是：1. 同行恶意攻击；2. 群众恶意维权。 　　----------------------------- 　　@临时注册的用户 2015-09-12 13:40:07 　　目前负面传言比较多的现货交易所或者现货交易中心有：北京大宗商品交易所，齐鲁商品交易中心，华夏商品交易市场，新华大宗商品交易中心，深圳石油化工交易所。当然这些交易中心或者交易所的说法是：1. 同行恶意攻击；2. 群众恶意维权。 　　----------------------------- 　　这些交易所打者后台的旗号挂羊头卖狗肉，有再多钱都能亏完，有进无出 作者：u_105771574 时间：2015-09-15 14:59:46   　　顶楼主, #此为分隔符#] 作者：u_105771574 时间：2015-09-15 15:00:41]";
	strings = a.split("标题：|正文：");
	FileWriter writer;
	try {
//		writer = new FileWriter("d:\\a.txt");
		PrintWriter pw = new PrintWriter(new FileOutputStream("d:\\a.txt")) ;
		for(int i=0;i<strings.length;i++)
		{
			String temp = strings[i].trim().replace("[", " ");
			temp = temp.replace("]", " ");
//			System.out.println(temp);
			pw.println(temp);
			
//			writer.write(temp);
			
		}
//		writer.flush();
//		writer.close();
		pw.flush();
		pw.close();
	} catch (Exception e) {
		// TODO Auto-generated catch block
		e.printStackTrace();
	}
	
}
}
